Repository: TuTAH1/OneCommander-Localization
Catalog: Rapidrive.*.xlf
Languages: th

# HideExtensionIfExtensionColumnVisible
source: Hide file extension after filename if extension column is visible
th: ซ่อนนามสกุลไฟล์ถ้ามองเห็นคอลัมน์นามสกุลอยู่แล้ว

# HideTemporary
source: Hide temporary files
th: ซ่อนไฟล์ชั่วคราว

# HotkeyInfo
source: Program must be running for above hotkeys to work Program restart required
th: โปรแกรมต้องทํางานอยู่เพื่อใช้งานปุ่มลัดด้านบนได้ ต้องเริ่มการทํางานของโปรแกรมใหม่

# HotkeyVizor
source: Use global hotkey Ctrl+` to show docked program window
th: ใช้ global hotkey Ctrl+' เพื่อแสดงหน้าต่างโปรแกรมแบบ docked

# HotkeyVizorInfo
source: Disable this if you use VS Code (uses the same shortcut)
th: ปิดใช้งานถ้าคุณใช้ VS Code (ใช้แป้นลัดเดียวกัน)

# IconsPackInfo
source: Icon packs contribute to program's overall memory use
th: ชุดไอคอนส่งผลต่อการใช้หน่วยความจำของโปรแกรมโดยรวม

# ImageScaleOriginal
source: Original size
th: ขนาดเดิม

# KeepRunningInBackground
source: Keep running in background (Close to System Tray)
th: ทํางานในเบื้องหลังต่อไป (แสดงไอคอนใน System tray)

# KeepRunningInBackgroundInfo
source: If On, program will stay in System Tray for faster next start. This should be enabled if program is set as a default file manager
th: ถ้าเปิด โปรแกรมจะอยู่ที่ System Tray เพื่อใช้งานครั้งต่อไปได้เร็วขึ้น ควรเปิดใช้งานตัวเลือกนี้หากต้องการใช้โปรแกรมเป็นตัวจัดการไฟล์เริ่มต้น

source: Language
th: ภาษา

# LanguageInfo
source: Restart required! Some languages are auto-translated using Microsoft Translator. If you would like to contribute to translating to your language, please write to support@onecommander.com
th: ต้องเริ่มการทํางานใหม่! บางภาษาถูกแปลโดยอัตโนมัติโดยใช้ Microsoft Translator หากคุณต้องการมีส่วนร่วมในการแปลภาษาของคุณโปรดส่งอีเมลมาที่ support@onecommander.com

# MetadataExcerpts
source: Show text excerpts for these file types (Adaptive and Thumbs+Details file views)
th: แสดงข้อความที่ตัดมาบางส่วนสําหรับไฟล์ประเภทเหล่านี้ (มุมมองแบบปรับได้และรูปย่อ+รายละเอียด)

# MetadataExcerptsInfo
source: Comma separated; no '.'; example: txt,bat,md; Content as ASCII/Plain-Text only
th: คั่นด้วยเครื่องหมายจุลภาค; ไม่ต้องใส่ '.'; เช่น: txt,bat,md; แสดงเฉพาะ ASCII/Plain-Text เท่านั้น

# MetadataLineCount
source: Lines of text
th: จำนวนบรรทัด

source: NEW
th: ใหม่

# NewTabDuplicateCurrent
source: Duplicate current
th: เปิดซ้ำแท็บปัจจุบัน

# NewTabOpenPath
source: Open path:
th: เปิดพาธ:

# NewTabPlacementAfterCurrent
source: After current
th: หลังแท็บปัจจุบัน

# NewTabPlacementAtEnd
source: At the end
th: ท้ายสุด

# NewTabPlacementQuestion
source: New tab should be placed:
th: วางแท็บใหม่ที่:

# NewTabQuestion
source: Creating a new tab should:
th: เมื่อสร้างแท็บใหม่ ควรจะ:

# OneDriveFolderPath
source: Path to OneDrive folder
th: พาธไปยังโฟลเดอร์ OneDrive

# OneDriveFolderPathInfo
source: If outside of C:\Users\YOURNAME\OneDrive; needed for additional synchronization status icons
th: ถ้าไม่ได้อยู่ใน C:\Users\YOURNAME\OneDrive; จําเป็นสําหรับการแสดงสถานะของไอคอนซิงค์

# OnStartOpenPath
source: Open path:
th: เปิดพาธ:

# OnStartQuestion
source: On start:
th: เมื่อเริ่มโปรแกรม:

# OnStartRestoreTabs
source: Restore tabs from previous session
th: แสดงแท็บจากครั้งก่อน

# OpeningItemsSingleClickFiles
source: Single click also opens files
th: คลิกครั้งเดียวเป็นการเปิดไฟล์

# OptUseThinScrollbar
source: Use thin scrollbar
th: ใช้แถบเลื่อนขนาดเล็ก

source: Other
th: อื่นๆ

# PhotoLocationQuestion
source: Photo location button opens web browser with:
th: ปุ่มตําแหน่งที่ตั้งของรูปถ่ายจะเปิดเว็บเบราว์เซอร์ด้วย:

# PreviewAutoplay
source: Autoplay video/audio files in preview window
th: เล่นไฟล์วิดีโอ/เสียงโดยอัตโนมัติในหน้าต่างแสดงตัวอย่าง

# PreviewShortcut
source: Pressing Spacebar key opens file preview window
th: การกดแป้น Spacebar จะเปิดหน้าต่างแสดงตัวอย่าง

# PreviewShortcutEsc
source: (Pressing Esc or Spacebar again closes it)
th: (การกด Esc หรือ Spacebar อีกครั้งจะปิดหน้าต่าง)

# PreviewWindowOptBuiltIn
source: Built-in preview
th: แสดงตัวอย่างด้วยฟังก์ชันของโปรแกรม

# PreviewWindowOptQuicklook
source: QuickLook (must be manually installed)
th: QuickLook (ต้องติดตั้งด้วยตนเอง)

# RegisterMaxThumbs
source: Register 3ds Max thumbnail handler
th: ลงทะเบียนตัวจัดการรูปขนาดย่อ 3ds Max

# RenameItemsOnSecondClick
source: Rename items by clicking again without moving cursor
th: เปลี่ยนชื่อรายการด้วยการคลิกอีกครั้งโดยไม่ขยับเคอร์เซอร์

# RenderingInfo
source: Software rendering is slower and shouldn't be used unless running on a Virtual Machine. Acrylic effect will be turned off. Program restart required
th: การแสดงผลด้วยซอฟท์แวร์ช้ากว่าและไม่ควรใช้เว้นแต่ต้องการทำงานบน Virtual Machine การแสดงสีแบบอะคริลิคจะถูกปิด ต้องเริ่มการทํางานของโปรแกรมใหม่

# RenderingQuestion
source: Rendering
th: กำลังแสดงภาพ

# RenderingSoftware
source: Software
th: ซอฟต์แวร์

# RestoreDefault
source: Restore to default
th: เรียกคืนค่าเริ่มต้น

# ScrollingBehaviorItem
source: Item (snaps to item positions)
th: รายการ (จัดชิดกับตำแหน่งของรายการ)

# ScrollingBehaviorPixel
source: Pixel (smooth)
th: พิกเซล (ดูลื่นไหล)

# SettingsWindowTitle
source: Settings
th: การตั้งค่า

# ShortcutClickOpt1
source: Switch to the existing window
th: สลับไปยังหน้าต่างที่เปิดอยู่

# ShortcutClickOpt2
source: Prompt to create another window
th: พร้อมท์เพื่อสร้างหน้าต่างอื่น

# ShortcutClickQuestion
source: If program has a window open, double-clicking its shortcut should:
th: ถ้าโปรแกรมเปิดหน้าต่างอยู่ การดับเบิ้ลคลิกที่ทางลัดของโปรแกรมควร:

# ShortcutClickWithExistingWindowQuestion
source: If program has a window open, double-clicking its shortcut should
th: ถ้าโปรแกรมเปิดหน้าต่างอยู่ การดับเบิ้ลคลิกที่ทางลัดของโปรแกรมควร:

# ShortcutClickWithExistingWindowSwitch
source: Switch to the existing window
th: สลับไปยังหน้าต่างที่เปิดอยู่

# ShowErrorReportDialog
source: Show error report dialog on crash
th: เมื่อโปรแกรมขัดข้องให้แสดงกล่องโต้ตอบรายงานข้อผิดพลาด

# ShowErrorReportDialogInfo
source: On crash a window will show where you can write steps to reproduce the crash so it can be fixed in the next update
th: เมื่อเกิดข้อผิดพลาด จะแสดงหน้าต่างที่คุณสามารถเขียนขั้นตอนที่ทำให้เกิดข้อผิดพลาดนั้น เพื่อให้ผู้พัฒนาแก้ไขในการอัพเดตครั้งต่อไป

# ShowFileAttributes
source: Show file attributes and synchronization state icons
th: แสดงไฟล์แอตทริบิวต์และไอคอนสถานะการซิงค์ข้อมูล

# ShowFileAttributesInfo
source: Required to show OneDrive status icons when Files on Demand is enabled. Shows also encrypted and reparse icons. Better performance when off.
th: มีความจําเป็นต่อการแสดงไอคอนสถานะ OneDrive เมื่อเปิดใช้งาน File on Demand อีกทั้งยังแสดงไอคอน encrypted และ reparse ด้วย โปรแกรมทำงานได้ดีกว่าเมื่อปิดตัวเลือกนี้

source: Show file extension
th: แสดงนามสกุลไฟล์

# ShowFilesViewToolbar
source: Show Files View toolbar buttons
th: แสดงปุ่มเครื่องมือเลือกมุมมองไฟล์

# ShowFolderBackgroundImageInfo
source: If a folder contains a file named folder.jpg, cover.jpg, background.jpg or front.jpg, it will be loaded as its background image. Useful for music albums and movie posters
th: ถ้าในโฟลเดอร์มีไฟล์ชื่อ folder.jpg, cover.jpg, background.jpg หรือ front.jpg ไฟล์นั้นจะถูกแสดงเป็นภาพพื้นหลังของโฟลเดอร์ มีประโยชน์สำหรับทำปกเพลงหรือโปสเตอร์ภาพยนตร์

# ShowFolderSizeInfo
source: Uses Windows Shell to get Folder Size and is not always accurate but it is fast. Size format cannot be changed; Sorting folders by size is not supported
th: ใช้ Windows Shell เพื่อทราบขนาดโฟลเดอร์ แม้ไม่แม่นยำแต่ทำงานได้เร็ว ไม่สามารถเปลี่ยนรูปแบบขนาดได้ ไม่สนับสนุนการเรียงลําดับโฟลเดอร์ตามขนาด

# ShowFolderSizeOnNetwork
source: Show Folder size on network folders
th: แสดงขนาดของโฟลเดอร์บนเครือข่าย

# ShowFolderSizeOnNetworkInfo
source: Off by default as it makes browsing network folders slower
th: ค่าเริ่มต้นคือปิด เนื่องจากจะทําให้การเรียกดูโฟลเดอร์บนเครือข่ายช้าลง

# ShowHidden
source: Show hidden files and folders
th: แสดงไฟล์และโฟลเดอร์ที่ถูกซ่อน

# ShowMetadataOnNetwork
source: Show Metadata on network files
th: แสดง Metadata ของไฟล์บนเครือข่าย

# ShowMetadataOnNetworkInfo
source: Off by default as it makes browsing network folders slower
th: ค่าเริ่มต้นคือปิด เนื่องจากจะทําให้การเรียกดูโฟลเดอร์บนเครือข่ายช้าลง

# ShowSystem
source: Show system files and folders
th: แสดงไฟล์และโฟลเดอร์ระบบ

# ShowWarningOnExtensionChange
source: Show warning dialog when changing extension during rename
th: แสดงคําเตือนแบบโต้ตอบเมื่อเปลี่ยนสกุลไฟล์ในระหว่างการเปลี่ยนชื่อ

source: Size format
th: รูปแบบเลขแสดงขนาด

# SizeFormatFolderSizeInfo
source: This will not affect folder size display (it is provided by Windows)
th: ตัวเลือกนี้จะไม่มีผลต่อการแสดงขนาดโฟลเดอร์ (เพราะแสดงจากวินโดวส์)

# SkipSearchingReparsePoints
source: Skip searching within reparse points
th: ข้ามการค้นหาภายใน reparse points

# SkipSearchingReparsePointsInfo
source: Use this only if you know you have cyclical reparse points that would result in never-ending search. Checking this will break searching cloud drives as those rely on reparse points
th: ใช้ตัวเลือกนี้เฉพาะเมื่อคุณทราบว่าคุณมี cyclical reparse points ซึ่งจะทำให้เกิดการค้นหาไม่รู้จบ การใช้ตัวเลือกนี้จะทำให้ไม่สามารถค้นหาในคลาวด์ไดรฟ์ได้เพราะคลาวด์ไดรฟ์ใช้การ reparse points

# SortDirAscending
source: Ascending
th: จากน้อยไปมาก

# SortDirDescending
source: Descending
th: จากมากไปน้อย

source: Sort direction
th: ทิศทางการเรียงลำดับ

# SortFileDate
source: Date modified
th: วันที่แก้ไข

# SortFileDateCreated
source: Date created
th: วันที่สร้าง

# SortFileName
source: Name
th: ชื่อ

# SortFileSize
source: Size
th: ขนาด

# SortFileType
source: Type
th: ประเภท

# SortFoldersByNameInfo
source: If ON: Even if you sort files by date, folders will remain sorted by name
th: ถ้าเปิด: แม้ว่าคุณจะเรียงลําดับไฟล์ตามวันที่ โฟลเดอร์จะยังคงเรียงลําดับตามชื่อ

source: Sort items by
th: เรียงลําดับรายการตาม

# SortKeepFoldersOnTop
source: Keep folders on top
th: วางโฟลเดอร์ไว้ด้านบน

# TabAdvanced
source: Advanced
th: ขั้นสูง

# TabColumns
source: Columns
th: คอลัมน์

# TabGeneral
source: General
th: ทั่วไป

# TabOther
source: Other
th: อื่นๆ

# TabPreview
source: Preview
th: แสดงตัวอย่าง

# TabsShowFullPath
source: Full path (C:\Windows\Sy...\Foldername)
th: พาธแบบเต็ม (C:\Windows\Sy...\ชื่อโฟลเดอร์)

# TabsShowNameOnly
source: Folder only (Foldername)
th: ชื่อโฟลเดอร์เท่านั้น

# TabTheme
source: Theme
th: ธีม

# TabView
source: View
th: มุมมอง

# TabWindow
source: Window
th: หน้าต่าง

# ThemeCreationTip
source: To create a custom theme: make a copy of a theme from \Themes folder and edit values in .xaml file
th: เมื่อต้องการสร้างธีมเอง ให้คัดลอกธีมจากโฟลเดอร์ \Themes และแก้ไขค่าในไฟล์ .xaml

# ThumbnailExcludedExtensions
source: File extensions to exclude thumbnails
th: สกุลของไฟล์ที่ไม่ต้องแสดงรูปย่อ

source: Time format
th: รูปแบบเวลา

# TimeFormat12h
source: 12h with AM/PM
th: 12h กับ AM/PM

source: Use Acrylic window
th: ใช้หน้าต่างสีอะคริลิค

# UseAcrylicWindowInfo
source: Restart program to apply. Better performance when off
th: เริ่มการทํางานของโปรแกรมใหม่เพื่อเปิดใช้ โปรแกรมจะทำงานดีกว่าเมื่อปิดไว้

# UseAcrylicWindowSoftwareRenderingWarning
source: Acrylic effect is not available with Software rendering as it would be too slow (Check Advanced tab)
th: การแสดงสีอะคริลิคใช้ไม่ได้กับการแสดงผลแบบซอฟต์แวร์เพราะทำงานได้ช้า (ตรวจสอบแท็บขั้นสูง)

# UseHighResScrolling
source: Use high-resolution touchpad scrolling
th: ใช้การเลื่อนของทัชแพ็ดความละเอียดสูง

# UseHighResScrollingInfo
source: Default ON
th: เริ่มต้นคือเปิด

# UseLayoutRounding
source: Pixel-perfect layout
th: เค้าโครงแบบ Pixel-perfect

# UseLayoutRoundingInfo
source: Default ON. Makes lines sharper on non-HDPI screens. Program is more stable when Off, but icons and lines may not be as sharp.
th: เริ่มต้นคือเปิด ทําให้เส้นคมชัดขึ้นบนหน้าจอที่ไม่ใช่ HDPI โปรแกรมจะเสถียรมากกว่าเมื่อปิด แต่ไอคอนและเส้นอาจไม่คมชัด

# UseMicaWindow
source: Use Mica window effect
th: ใช้ลักษณะหน้าต่างพิเศษของ Mica

source: Use old definition of Megabyte
th: ใช้ Megabyte แบบดั้งเดิม

# UseOldDefinitionOfMegabyteInfo
source: Turn ON if you prefer using Mebibytes instead of Megabytes 1 Mebibyte = 2^20 bytes = 1048576 bytes (IEC) 1 Megabyte (MB) = 10^6 bytes = 1000000 bytes (SI standard)
th: ให้เปิดถ้าคุณต้องการใช้ Mebibytes แทน Megabytes 1 เมกะไบต์ = 2^20 ไบต์ = 1048576 ไบต์ (IEC) 1 เมกะไบต์ (MB) = 10^6 ไบต์ = 1000000 ไบต์ (มาตรฐาน SI)

# UseOldDragAndDropSystem
source: Use old Drag&Drop system
th: ใช้ระบบการลาก&วางแบบเก่า

# UseOldDragAndDropSystemInfo
source: Default OFF. Turn on if programs that used to accept drop operations from OC stopped accepting files. Please report if any program has issues with drop operations. Acrobat page-insert is known not to work with either.
th: เริ่มต้นคือปิด ให้เปิดถ้าพบโปรแกรมที่ไม่ยอมรับการลากและวางไฟล์จาก OC ทั้ง ๆ ที่เมื่อก่อนเคยใช้แบบนั้นได้ โปรดรายงานปัญหาหากพบโปรแกรมลักษณะดังกล่าว โปรดทราบว่าเราพบปัญหานี้กับการแทรกหน้าของโปรแกรม Acrobat ด้วย

# UsePDFThumbs
source: Custom .pdf and .ai thumbnail extraction
th: การจำลองรูปย่อของ .pdf และ .ai แบบกำหนดเอง

source: Windows default
th: ค่าเริ่มต้นของ Windows

# WindowSettings
source: One Commander Settings
th: การตั้งค่า One Commander

# WinEUnregister
source: Unregister hotkey
th: ยกเลิกการลงทะเบียนปุ่มลัด

# WinOOpt1
source: Switch to a Virtual Desktop where One Commander is open
th: สลับไปยังเดสก์ท็อปเสมือนที่ One Commander เปิดอยู่

# WinOOpt2
source: Bring One Commander to the current Virtual Desktop
th: ย้าย One Commander มายังเดสก์ท็อปเสมือนปัจจุบัน

# WinOQuestion
source: Pressing Win+Alt+O from any program should:
th: กด Win+Alt+O จากโปรแกรมใด ๆ ควรทำให้:

# AgeDayShort
source: d
th: ว

# AgeHourShort
source: h
th: ชม

# AgeMinuteShort
source: min
th: น

# AgeMonthShort
source: M
th: ด

# AgeSecondShort
source: s
th: วิ

# AgeYearShort
source: y
th: ปี

# AliasThisPC
source: This PC
th: พีซีเครื่องนี้

# Archive_Extracting
source: Extracting {0}
th: กำลังแยกไฟล์ {0}

# Archive_FileExistsAskToReplace
source: File {0} already exists in the destination folder. Replace all?
th: ไฟล์ {0} มีอยู่แล้วในโฟลเดอร์ปลายทาง แทนที่ทั้งหมดหรือไม่?

# Archive_WaitingToExtract
source: Waiting to extract {0}
th: กําลังรอที่จะแยกไฟล์ {0}

# Button_Apply
source: Apply
th: นำไปใช้

# Button_Cancel
source: Cancel
th: ยกเลิก

# Button_No
source: No
th: ไม่ใช่

# Button_OK
source: OK
th: ตกลง

# Button_Yes
source: Yes
th: ใช่

# ChangeFilesView_TT
source: Change files view
th: เปลี่ยนมุมมองไฟล์

# ClipboardCopy_TT
source: Copy to Clipboard
th: คัดลอกไปยังคลิปบอร์ด

# ColumnsToggle_S
source: ` (under ESC key)
th: ' (ใต้ปุ่ม ESC)

# ColumnsToggle_TT
source: Toggle columns navigation
th: สลับ column navigation

source: Computer
th: คอมพิวเตอร์

# CopyPath_TT
source: Copy path to clipboard
th: คัดลอกพาธไปยังคลิปบอร์ด

# CursorCopy
source: COPY
th: คัดลอก

# CursorMove
source: MOVE
th: ย้าย

# Delete_S
source: Del
th: ลบ

# Delete_TT
source: Delete selected items
th: ลบรายการที่เลือก

# DetailsAccessed
source: Accessed
th: เข้าถึงแล้ว

# DetailsAge
source: Age
th: อายุ

# DetailsCreated
source: Created
th: สร้างเมื่อ

# DetailsFileSystem
source: File system
th: ระบบไฟล์

# DetailsModified
source: Modified
th: แก้ไขเมื่อ

# DetailsName
source: Name
th: ชื่อ

# DetailsPath
source: Path
th: พาธ

# DetailsSize
source: Size
th: ขนาด

# DetailsType
source: Type
th: ประเภท

# DividerButtonsHorizontalLayout_TT
source: Use ˄ ˅ buttons on this divider to show/hide browser panes
th: ใช้ปุ่ม ˄ ˅ บนตัวแบ่งนี้เพื่อแสดง/ซ่อนบานหน้าต่างเบราว์เซอร์

# DividerButtonsVerticalLayout_TT
source: Use < > buttons on this divider to show/hide browser panes
th: กด < > ปุ่มตัวแบ่งนี้เพื่อแสดง/ซ่อนบานหน้าต่างเบราเซอร์

# Divider_Notifications
source: NOTIFICATIONS
th: การแจ้งเตือน

# DLG_E_DateFormatInvalid
source: This is not a valid date format in .NET standard. Resetting to default
th: รูปแบบวันที่นี้ไม่ถูกต้องตามมาตรฐาน .NET โปรแกรมจะใช้ค่าเริ่มต้น

# DLG_E_RunningFromProgramFiles
source: Portable programs need a write access in their own folders so they cannot live in "Program Files" folder. Please move the entire folder to a <b>non-system folder</b> and run it again
th: โปรแกรมแบบ portable จะต้องได้รับสิทธิ์การเขียนในโฟลเดอร์ของโปรแกรมเอง จึงไม่อาจเก็บโปรแกรมไว้ในโฟลเดอร์ "Program Files" โปรดย้ายโฟลเดอร์โปรแกรมไปไว้ใน <b>โฟลเดอร์ซึ่งไม่ใช่ของระบบปฏิบัติการ</b> จากนั้นเปิดโปรแกรมอีกครั้ง

# DLG_FolderNotFound
source: Folder {0} not found
th: ไม่พบ {0} โฟลเดอร์

# DLG_HowToCloseProgram
source: To close One Commander completely, <B>hold CTRL while clicking the close button</B>, or right-click the One Commander icon in System Tray (next to clock), and select <i>Exit</i>
th: เพื่อจะปิด One Commander อย่างสมบูรณ์ <B>ให้กดปุ่ม CTRL ค้างไว้ขณะกดปุ่มปิด</B> หรือคลิกขวาที่ไอคอน One Commander ซึ่งอยู่ใน System Tray (ใกล้กับนาฬิกา) และเลือก <i>ออก</i>

# DLG_PreviewDisabledWhenFiltering
source: Spacebar still works as Preview even when filtering files. Space cannot be used for filter
th: ใช้ปุ่ม Spacebar เพื่อแสดงตัวอย่างได้แม้เมื่อทำการ filter ไฟล์ แต่ไม่สามารถใช้ช่องว่างใน filter ได้

# DLG_UpdatedIconPacks
source: Icon packs updated. Look for new entries in file/folder icon pack selection boxes
th: อัพเดตชุดไอคอนแล้ว ค้นหารายการใหม่ในกล่องการเลือกชุดไอคอนไฟล์/โฟลเดอร์

# DLG_YN_AddOriginalExtensionBack
source: The file extension is different. Do you want to <B>add the original extension back</B> so the file can open with the same associated program?
th: สกุลไฟล์ต่างจากเดิม คุณต้องการที่จะ <B>ใช้สกุลเดิมไหม</B> เพื่อจะสามารถเปิดไฟล์ด้วยโปรแกรมที่เชื่อมโยงกับสกุลเดิมได้?

# DLG_YN_FavoritesDoesNotExistRemoveIt
source: This path doesn't exist. Remove it?
th: ไม่พบพาธนี้ ลบออกหรือไม่?

# DLG_YN_FeatureRequiresProVersion
source: This feature is available only in Pro version. <b>Get the Pro version now?</b>
th: คุณสมบัตินี้มีให้ใช้ในรุ่นโปรเท่านั้น <b>ซื้อรุ่นโปรเลยไหม?</b>

# DLG_YN_KeepProgramRunningInBackground
source: When closing the last window, do you want the program to <B>keep running in the background</B> (icon in System Tray) for faster next start?
th: เมื่อปิดหน้าต่าง คุณต้องการให้โปรแกรม <B>ทำงานอยู่ในเบื้องหลัง</B> ไหม (แสดงไอคอนใน system tray) เพื่อการใช้งานที่รวดเร็วขึ้นในครั้งถัดไป?

# DLG_YN_RenameWhenClickingOutside
source: You've changed name but clicked outside.<br/>Do you want to <b>always rename the file</b> in this situation?<br/>Press <i>No</i> to alwasy require explicitly confirming rename operation
th: คุณเพิ่งเปลี่ยนชื่อไฟล์ แต่จากนั้นไปคลิกที่อื่น <br/>คุณต้องการที่จะ <b>เปลี่ยนชื่อไฟล์เสมอ</b> เมื่อเกิดเหตุการณ์เช่นนี้ไหม?<br/>กด <i>ไม่</i> เพื่อให้ถามทุกครั้งก่อนดำเนินการเปลี่ยนชื่อไฟล์

# DLG_YN_RestartAsAdmin
source: Restart program as Admin? This will <b>cancel all ongoing file transfers</b> and other processes running through One Commander
th: เริ่มการทำงานโปรแกรมใหม่ในฐานะ Admin ไหม? การทำแบบนี้จะ <b>ยกเลิกการย้ายไฟล์ที่กำลังทำอยู่ทุกอย่าง</b> รวมถึงการดำเนินงานอย่างอื่นที่ทำจาก One Commander ด้วย

source: Drives
th: ไดรฟ์

source: Edit File Views
th: แก้ไขมุมมองไฟล์

# EditPath_TT
source: Edit path
th: แก้ไขพาธ

source: Eject
th: ถอดไดรฟ์

source: Error
th: ข้อผิดพลาด

# FavoritesSidebarOpen_TT
source: Open Favorites sidebar
th: เปิดรายการโปรดแถบด้านข้าง

# FileType_2dx
source: Completed Note / ToDo Task
th: Note / ToDo Task ที่เสร็จแล้ว

# FileType_Folder
source: Folder
th: โฟลเดอร์

# FileType_Unspecified
source: Unspecified
th: ไม่มีการระบุ

# Filter_Contains
source: Contains:
th: ประกอบด้วย:

# Filter_Extension
source: Extension:
th: สกุล:

# ItemsSelected
source: selected
th: เลือกไว้

# ItemsTotal
source: items
th: รายการ

# JumplistActions
source: Actions
th: การดำเนินการ

# LayoutSwitch_TT
source: Switch between Standard and Columns layouts
th: สลับระหว่างเค้าโครงแนวนอนและแนวตั้ง

# LocateItem_TT
source: Locate item
th: ระบุตำแหน่ง

source: Login
th: เข้าสู่ระบบ

# MapNetDrive_Letter
source: Drive letter to mount (e.g. 'K')
th: ไดรฟ์ที่ต้องการ mount (เช่น 'K')

# MapNetDrive_Path
source: Network path (e.g. \\computername\share)
th: พาธเครือข่าย (เช่น \\computername\share)

# Menu_ArchiveExtractHere
source: Extract here
th: แยกลงที่นี่

# Menu_ArchiveExtractToFolder
source: Extract to "{0}\"
th: แยกไฟล์ที่ "{0}\"

# Menu_ArchiveOpen
source: Open external
th: เปิดด้วยแอพอื่น

# Menu_Copy
source: Copy
th: คัดลอก

# Menu_CopyAsPath
source: Copy as path
th: คัดลอกพาธ

# Menu_CopyToOtherBrowser
source: Copy to the opposite browser pane
th: คัดลอกไปยังบานหน้าต่างตรงข้าม

# Menu_FavoritesGroup_Delete
source: Delete group
th: ลบกลุ่ม

# Menu_FavoritesGroup_MoveDown
source: Move down
th: ย้ายลง

# Menu_FavoritesGroup_MoveUp
source: Move up
th: ย้ายขึ้น

# Menu_FavoritesGroup_Rename
source: Rename Group
th: เปลี่ยนชื่อกลุ่ม

# Menu_Move
source: Move
th: ย้าย

# Menu_MoveToOtherBrowser
source: Move to the opposite browser pane
th: ย้ายไปยังบานหน้าต่างตรงข้าม

# Menu_New
source: New...
th: สร้าง...

# Menu_NewFile
source: File
th: ไฟล์

# Menu_NewFolder
source: Folder
th: โฟลเดอร์

# Menu_NewNote
source: Note
th: โน้ต

# Menu_OpenCommandShell
source: Open in command shell
th: เปิดใน command shell

# Menu_OpenInNewTab
source: New tab
th: แท็บใหม่

# Menu_OpenInNewTabOtherBrowser
source: New tab in other browser pane
th: แท็บใหม่ในบานหน้าต่างอื่น

# Menu_RemovePath
source: Remove from group
th: เอาออกจากกลุ่ม

# Menu_Rename
source: Rename
th: เปลี่ยนชื่อ

# Menu_RenameMultiple
source: Rename with File Automator
th: เปลี่ยนชื่อด้วย File Automator

# Menu_SortByDateCreated_NewestFirst
source: Date created (Newest first)
th: วันที่สร้าง (ใหม่ที่สุดก่อน)

# Menu_SortByDate_NewestFirst
source: Date modified (Newest first)
th: วันที่แก้ไข (ใหม่ที่สุดก่อน)

# Menu_SortByDate_OldestFirst
source: Date modified (Oldest first)
th: วันที่แก้ไข (เก่าที่สุดก่อน)

# Menu_SortByName_Ascending
source: Name (A-Z)
th: ชื่อ (A-Z)

# Menu_SortByName_Decending
source: Name (Z-A)
th: ชื่อ (Z-A)

# MSG_E_AccessDenied
source: Access denied
th: ปฏิเสธการเข้าใช้

# MSG_E_ClipboardImagePasteFailed
source: Couldn't create image file from Clipboard data
th: ไม่สามารถสร้างไฟล์รูปจากข้อมูลในคลิปบอร์ด

# MSG_E_ClipboardNoFiles
source: Clipboard doesn't contain files
th: ไม่มีไฟล์ในคลิปบอร์ด

# MSG_E_ClipboardTextPasteFailed
source: Couldn't create text file from Clipboard data
th: ไม่สามารถสร้างไฟล์ข้อความจากข้อมูลในคลิปบอร์ด

# MSG_E_ClipboardUsedByAnotherProcess
source: Error: program {0} is blocking Windows Clipboard
th: ข้อผิดพลาด: Windows คลิปบอร์ดกำลังถูกใช้งานในโพรเซส {0}

# MSG_E_CommandShellOpenFail
source: Could not open {0} here
th: ไม่สามารถเปิด {0} ที่นี่

# MSG_E_DownloadingThemeResourcesFailed
source: Downloading theme resources failed with error: {0}
th: การดาวน์โหลดชุดธีมล้มเหลวโดยมีข้อผิดพลาด: {0}

# MSG_E_DragDropFormatError
source: Drop data error. Source program did not format it correcly or filenames had invalid characters
th: ข้อผิดพลาดในการวางไฟล์ โปรแกรมต้นทางใช้รูปแบบไฟล์ที่ไม่ถูกต้องหรือชื่อไฟล์มีอักขระที่ไม่รองรับ

# MSG_E_DriveNotConnected
source: Drive {0} is not connected
th: ไม่ได้เชื่อมต่อไดรฟ์ {0}

# MSG_E_DriveSlowingDownComputer
source: Drive {0} might be slowing down your computer (waiting to wake up / spin up?)
th: ไดรฟ์ {0} อาจทําให้คอมพิวเตอร์ของคุณทํางานช้าลง (รอไดรฟ์ทำงานไหม?)

# MSG_E_DropContent
source: Issue with drop data: {0}
th: ปัญหาเกี่ยวกับการวางข้อมูล: {0}

# MSG_E_DropContentFromOutlook
source: Invalid Outlook data. Are you using the latest Outlook? {0}
th: ข้อมูล Outlook ไม่ถูกต้อง คุณกําลังใช้ Outlook ล่าสุดอยู่หรือไม่? {0}

# MSG_E_DropFileContentsError
source: Error creating files from drop package. Windows reported: {0}
th: เกิดข้อผิดพลาดในการสร้างไฟล์จากแพคเกจที่นำมาวาง รายงานไปยังวินโดวส์: {0}

# MSG_E_ErrorOpeningPath
source: Error opening path {0}
th: ข้อผิดพลาดในการเปิดพาธ {0}

# MSG_E_FileAlreadyExists
source: File with this name already exists
th: มีไฟล์ที่ใช้ชื่อนี้อยู่แล้ว

# MSG_E_FileNotFound
source: File {0} not found
th: ไม่พบไฟล์ {0}

# MSG_E_FolderDoesNotExist
source: Folder doesn't exist {0}
th: ไม่มีโฟลเดอร์อยู่ {0}
