Repository: TuTAH1/OneCommander-Localization
Catalog: Rapidrive.*.xlf
Languages: th

source: Already purchased?
th: ซื้อแล้วใช่ไหม?

source: Anonymized Hardware ID:
th: หมายเลขฮาร์ดแวร์:

# AnonymizedHardwareIDGenerating
source: Generating Anonymized Hardware ID...
th: กําลังสร้างหมายเลขฮาร์ดแวร์...

# DLG_ThankYou
source: Thank you for the purchase and supporting program development. Please restart the program to enable all features
th: ขอบคุณสําหรับการซื้อและสนับสนุนการพัฒนาโปรแกรม กรุณารีสตาร์ทโปรแกรมใหม่เพื่อเปิดใช้งานคุณลักษณะทั้งหมด

# GetOnMicrosoftStore
source: Get it on Microsoft Store
th: ดาวน์โหลดจากไมโครซอฟท์สโตร์

source: License code:
th: รหัสใบอนุญาต:

# LicenseCodeWrong
source: Wrong license length
th: เลขใบอนุญาตมีความยาวไม่ถูกต้อง

source: Network error
th: ข้อผิดพลาดจากเครือข่าย

# PortableLicenseInfo
source: The license is valid for this computer only
th: สิทธิ์การใช้งานใช้ได้กับคอมพิวเตอร์เครื่องนี้เท่านั้น

# ProLicenseInfo
source: One Commander is free for HOME use with a limited features set. For commercial use, the PRO license is required, regardless if the user needs these additional features (labeled with PRO in Settings).
th: One Commander ใช้งานได้ฟรีสำหรับรุ่นโฮม โดยจำกัดคุณสมบัติบางอย่าง แต่สําหรับการใช้งานเชิงพาณิชย์จําเป็นต้องใช้รุ่นโปร ไม่ว่าผู้ใช้งานต้องการคุณสมบัติเพิ่มเติมเหล่านี้หรือไม่ (ติดป้ายโปร ในการตั้งค่า)

# PurchaseStepsPart1
source: 1. Using the above button open the purchase page and paste the Hardware ID (it should already be on clipboard) and enter your email 2. After completing the purchase, you should receive an automatic email with activation code (check spam also) 3. Paste the license from the email into the field below
th: 1. เมื่อกดปุ่มด้านบนนี้ จะคัดลอกรหัสฮาร์ดแวร์และเปิดเว็บไซต์ไปยังหน้าซื้อโปรแกรม โปรดวางรหัสฮาร์ดแวร์ในช่อง Hardware ID และกรอกอีเมลของคุณ 2. หลังจากทําการซื้อเสร็จแล้ว คุณจะได้รับอีเมลอัตโนมัติพร้อมรหัสลิขสิทธิ์ (โปรดตรวจสอบกล่องสแปมด้วย) 3. คัดลอกรหัสลิขสิทธิ์และวางในกล่องข้อความด้านล่าง

# StoreErrorChecking
source: Error checking Microsoft Store
th: ข้อผิดพลาดจากการตรวจสอบไมโครซอฟท์สโตร์

# StoreLicenseInfo
source: Before making a purchase, please make sure you are signed into Microsoft Store with an account that you'd like to associate with this purchase, so you can reinstall it in the future and on additional computers with the same account. The license will be valid for up to 10 computers used with the same Microsoft Account (as defined in Microsoft Store policy)
th: ก่อนซื้อ โปรดตรวจสอบว่าคุณได้ลงชื่อเข้าใช้ Microsoft Store ด้วยบัญชีที่คุณต้องการเชื่อมโยงกับการซื้อนี้ เพื่อให้คุณสามารถติดตั้งใหม่ได้ในอนาคตและในคอมพิวเตอร์เครื่องอื่นที่ใช้บัญชีเดียวกัน สิทธิ์การใช้งานจะมีผลกับคอมพิวเตอร์สูงสุด 10 เครื่องที่ใช้บัญชี Microsoft เดียวกัน (ตามที่กําหนดไว้ในนโยบาย Microsoft Store)

# StoreLicenseRequired
source: Pro license is required to use in a commercial setting.<br/>Please test it for a couple of days but if you find the program useful please purchase the license from the Microsoft Store (through About dialog)
th: การใช้ในเชิงพาณิชย์จำเป็นต้องมีใบอนุญาตรุ่น Pro<br/>โปรดทดลองใช้โปรแกรมระยะหนึ่ง หากคุณพบว่าโปรแกรมมีประโยชน์โปรดซื้อใบอนุญาตจาก Microsoft Store (โปรดดู 'เกี่ยวกับ')

# StoreNoValidLicenseFound
source: Couldn't find a valid license with the current Microsoft account. Please check your email for the original purchase receipt and then click the button below to log into the same account that was used to purchase the license.
th: ไม่พบสิทธิ์การใช้งานของบัญชี Microsoft ปัจจุบัน โปรดตรวจสอบใบเสร็จรับเงินในอีเมลที่เคยใช้ในการซื้อโปรแกรมแล้วคลิกปุ่มด้านล่างเพื่อเข้าสู่ระบบด้วยบัญชีนั้น

# StorePleaseWait
source: Please wait for the Microsoft Store...
th: รอสักครู่เพื่อเชื่อมต่อไมโครซอฟท์สโตร์...

# StorePurchaseVerified
source: Existing purchase verified. Please restart program to unlock all features.
th: การซื้อของคุณได้รับการยืนยันแล้ว กรุณารีสตาร์ทโปรแกรมใหม่เพื่อเปิดการใช้งานคุณสมบัติทั้งหมด

# StoreStatusPurchaseNotComplete
source: The purchase did not complete. You can complete the purchase anytime Microsoft Store is available.
th: การซื้อไม่เสร็จสมบูรณ์ คุณสามารถดําเนินการต่อได้ทันทีเมื่อไมโครซอฟท์สโตร์พร้อมใช้งาน

# VolumeLicenseInfo
source: Volume licenses available if purchased for domain:
th: ซื้อใบอนุญาตแบบกลุ่มสำหรับโดเมน:

# ApplyToCurrent
source: Apply to current folder-pane and close (without saving)
th: นําไปใช้กับบานหน้าต่างโฟลเดอร์ปัจจุบันแล้วปิด (ไม่บันทึก)

source: Custom height
th: กำหนดความสูง

# CustomHeight_TT
source: If you are using Thumbnail, make it the same height
th: ถ้าแสดงรูปขนาดย่อ (Thumbnail) กำหนดให้มันสูงเท่ากัน

source: Edited view:
th: มุมมองแก้ไข:

source: Element
th: องค์ประกอบ

source: Element align
th: การจัดเรียงองค์ประกอบ

source: Fit text
th: พอดีกับข้อความ

source: Height
th: ความสูง

source: Icon
th: ไอคอน

source: Item height
th: ความสูงของวัตถุ

source: Load
th: โหลด

source: Min.Width
th: ความกว้างต่ำสุด

source: On
th: เปิด

source: Padding
th: ช่องว่างภายใน

source: Removal order
th: ลําดับการนำออก

source: Resize to verify Removal Order
th: เลื่อนเพื่อทดสอบลำดับการนำออก

source: Save
th: บันทึก

source: Save as
th: บันทึกเป็น

# SaveNotice
source: Save as a custom View name to prevent restoring default views when program updates
th: สร้างบันทึกมุมมองแบบกําหนดเองเพื่อป้องกันการคืนค่ามุมมองเริ่มต้นเมื่ออัพเดตโปรแกรม

# SomeElementsAreHidden
source: Some elements are hidden due to available size (according to Removal Order)
th: องค์ประกอบบางอย่างถูกซ่อนไว้เนื่องจากมีที่ว่างไม่พอ (แสดงตามลำดับการนำออก)

source: Thumbnail
th: รูปขนาดย่อ

source: Update preview
th: อัพเดตการแสดงผล

source: Width
th: ความกว้าง

source: X offset
th: ออฟเซ็ต X

source: Credits and contributors
th: เครดิตและผู้สนับสนุน

source: Email
th: อีเมล

# EmailCopiedToClipboard
source: Email address copied to clipboard
th: คัดลอกที่อยู่อีเมลไปยังคลิปบอร์ดแล้ว

source: Exe location
th: ที่เก็บไฟล์ Exe

source: Forum
th: กระดานสนทนา

# KickstarterBackers
source: The first version of this program has been funded thanks to these 406 Kickstarter backers (names shown as in the Kickstarter profile):
th: โปรแกรมเวอร์ชั่นแรกได้รับเงินทุนจากผู้สนับสนุน Kickstarter เหล่านี้จำนวน 406 ท่าน (แสดงรายชื่อในโปรไฟล์ Kickstarter):

source: License Agreement
th: ข้อตกลงสิทธิ์การใช้งาน

# ProLicenseRequired
source: The Pro license is required for commercial use
th: จำเป็นต้องมีใบอนุญาตแบบโปรเพื่อใช้งานในเชิงพาณิชย์

source: Rate on Microsoft Store
th: ให้คะแนนในไมโครซอฟท์สโตร์

# ReadUserManual
source: Before contacting support, please read the user manual
th: โปรดศึกษาคู่มือผู้ใช้ก่อนติดต่อฝ่ายสนับสนุน

source: Search name
th: ชื่อสำหรับค้นหา

source: Settings location
th: ที่เก็บการตั้งค่า

source: Shortcuts
th: คีย์ลัด

# TabAbout
source: About
th: เกี่ยวกับ

# TabHelp
source: Help
th: ช่วยเหลือ

# TabLicenses
source: Licenses
th: สิทธิ์การใช้งาน

# UsingDlls
source: One Commander uses following DLLs (Libraries)
th: One Commander ใช้ DLLs ต่อไปนี้ (ไลบรารี)

source: Website
th: เว็บไซต์

source: Add rule
th: เพิ่มกฎ

source: Add watermark
th: เพิ่มลายน้ำ

source: Cancel
th: ยกเลิก

# CaseExtension
source: Extension letter case
th: รูปแบบอักษรของสกุลไฟล์

# CaseFileName
source: File name letter case
th: รูปแบบอักษรของชื่อไฟล์

# ChangeColorProfile
source: Change Color Profile to
th: เปลี่ยนโปรไฟล์สีเป็น

source: Clear
th: ล้าง

# ColumnDestination
source: Destination
th: ปลายทาง

# ColumnFile
source: File
th: ไฟล์

# ColumnIsNameValid_TT
source: Name validity
th: ความถูกต้องของชื่อ

# ColumnNewName
source: New file name
th: ชื่อใหม่

# ColumnOperation
source: Operation
th: การดำเนินการ

# ColumnSource
source: Source
th: ที่มา

# ColumnStatus
source: Status
th: สถานะ

# ConvertHashtag
source: Convert # into sequential number starting at
th: เปลี่ยน # เป็นตัวเลขลําดับ โดยเริ่มต้นที่

# ConvertHashtag_TT
source: Tip: To add 4 trailing zeros write #### in rule
th: เคล็ดลับ: เมื่อต้องการเพิ่มเลขศูนย์ต่อท้าย 4 ตัว ให้เขียน #### ในกฎ

# DateTimeDay
source: Day
th: วัน

# DateTimeHour
source: Hour
th: ชั่วโมง

# DateTimeMinute
source: Minute
th: นาที

# DateTimeMonth
source: Month
th: เดือน

# DateTimeYear
source: Year
th: ปี

source: Description
th: คําอธิบาย

# DestinationDir
source: Output folder defined by folder rules
th: โฟลเดอร์ผลลัพธ์ที่กําหนดโดยกฎโฟลเดอร์

# DestinationFile
source: Output filename as result of folder and file rules
th: ชื่อไฟล์ที่สอดคล้องกับกฎของโฟลเดอร์และไฟล์

# DLG_Busy
source: Please wait operation to finish before adding new items
th: โปรดรอให้การดำเนินการเสร็จสิ้นก่อนเพิ่มรายการใหม่

# ForcedExtension
source: Forced new file extension
th: กำหนดสกุลของไฟล์ใหม่

# ForcedExtension_TT
source: Leave blank to keep the original extension
th: ปล่อยว่างเพื่อใช้นามสกุลเดิม

# HeaderNaming
source: Naming
th: การตั้งชื่อ

source: Ignore case
th: ไม่สนใจตัวพิมพ์เล็กใหญ่

source: lowercase
th: ตัวพิมพ์เล็ก

# MSG_FileAlreadyExists
source: File with this name already exists
th: มีไฟล์ที่ใช้ชื่อนี้อยู่แล้ว

# MSG_FileNameConflict
source: File name conflict
th: ชื่อไฟล์ขัดแย้งกัน

# MSG_FileNameConflict2
source: Another file will get the same name (check file name rules)
th: อีกไฟล์หนึ่งจะมีชื่อเดียวกัน (ตรวจสอบกฎการตั้งชื่อไฟล์)

# MSG_FileNameInvalidCharacters
source: File contains invalid characters
th: ชื่อไฟล์มีอักขระที่ไม่รองรับ

# MSG_FolderNameInvalidCharacters
source: Folder name contains invalid characters
th: ชื่อโฟลเดอร์มีอักขระที่ไม่รองรับ

# MSG_NotImage
source: Not image
th: ไม่ใช่รูปภาพ

# MSG_Processing
source: Processing...
th: กำลังดำเนินการ...

# MSG_RunScript
source: Run script
th: รันสคริปต์

# OperationConvert
source: Convert to
th: แปลงเป็น

# OperationRename
source: Rename
th: เปลี่ยนชื่อ

# OperationRunScript
source: Run script
th: รันสคริปต์

source: Presets
th: คำสั่งสำเร็จรูป

source: Preview
th: แสดงตัวอย่าง

source: Process
th: ดำเนินการ

# RegExMatchNumbers
source: Match numbers
th: ตรงกับตัวเลข

# RegExMatchWord
source: Match word
th: ตรงกับคํา

source: Resize
th: ปรับขนาด

# ResizeModeFitWithin
source: Fit within
th: ขนาดไม่เกิน

# ResizeModeFixedHeight
source: Fixed height
th: กำหนดความสูง

# ResizeModeFixedWidth
source: Fixed width
th: กำหนดความกว้าง

# ResizeModeMinimumSize
source: Minimum size
th: ขนาดเล็กสุด

# ResizeMoreOptions
source: More options
th: ตัวเลือกเพิ่มเติม

# Result_Done
source: Done
th: เสร็จสิ้น

# Result_TaskCancelled
source: Task cancelled
th: งานถูกยกเลิก

source: Rotate
th: หมุน

# RuleReplace
source: Replace
th: แทนที่

# RuleTypeDocument
source: Document
th: เอกสาร

# RuleTypeImage
source: Image
th: รูปภาพ

# RuleTypeVideo
source: Video
th: วิดีโอ

# ScriptShowInStatus
source: Show shell output in Status area (otherwise CMD window will open)
th: แสดงเชลล์เอาต์พุตที่แถบสถานะ (มิฉะนั้นหน้าต่าง CMD จะเปิดขึ้น)

# ScriptShowInStatus_TT
source: Uncheck if you want it to be cancelable. Press Ctrl+C in CMD window to cancel operation
th: ไม่ต้องเลือกถ้าคุณต้องการให้ยกเลิกได้ กด Ctrl+C ในหน้าต่าง CMD เพื่อยกเลิกการดําเนินการ

# ShowSourceAndDestColumns
source: Show Source and Destination columns in the files list
th: แสดงคอลัมน์ต้นทางและปลายทางในรายการไฟล์

# SourceDir
source: Source folder of the file
th: โฟลเดอร์ต้นทางของไฟล์

# SourceFile
source: Full path to file
th: พาธแบบเต็มเพื่อไปยังไฟล์

# TT_Example
source: Example
th: ตัวอย่าง

# TT_ExampleOutput
source: Out
th: ผลลัพธ์

# TT_OriginalFilename
source: Original filename
th: ชื่อเดิมของไฟล์

source: Unchanged
th: ไม่เปลี่ยน

source: UPPERCASE
th: ตัวพิมพ์ใหญ่

# Watermark_DragFilesHereOrPaste
source: Drag files here or paste with Ctrl+V
th: ลากไฟล์มาที่นี่หรือวางด้วย Ctrl+V

source: Accent Color
th: สีไฮไลต์

# AccentColorGetFromWindows
source: Get from Windows
th: เลือกจากหน้าต่าง

# AccentColorHexValue
source: (HEX value in #RRGGBB format)
th: (ค่า HEX ในรูปแบบ #RRGGBB)

# AccentColorLocked
source: Accent color can't be changed because this particular theme forces a certain accent color
th: ไม่สามารถเปลี่ยนสีไฮไลต์ได้ เนื่องจากชุดรูปแบบนี้บังคับใช้สีไฮไลต์ที่กำหนดไว้

# AdvancedInfo
source: Rarely needed settings. Don't change unless absolutely necessary!
th: การตั้งค่านี้แทบไม่จำเป็นต้องเปลี่ยน อย่าเปลี่ยนเว้นแต่จําเป็นอย่างยิ่ง!

# AlignCenter
source: Center
th: กึ่งกลาง

# AlignLeft
source: Left
th: ชิดซ้าย

# AlignRight
source: Right
th: ชิดขวา

# AnimationDuration
source: Animation duration (ms)
th: ระยะเวลาของแอนิเมชั่น (ms)

# AnimationDurationTest
source: Click to test animation duration
th: คลิกเพื่อทดสอบระยะเวลาแอนิเมชั่น

# AutoSwitchToThumbViewInfo
source: Program will check a first few files in a folder and if most are images or videos it will load thumbnail view. Views that are already saved won't be affected
th: โปรแกรมจะโหลดมุมมองรูปขนาดย่อหากตรวจพบว่า 2-3 ไฟล์แรกในโฟลเดอร์เป็นรูปภาพหรือวีดีโอ แต่จะไม่ส่งผลต่อมุมมองที่ถูกบันทึกไว้แล้ว

# ColorFileAge
source: Color
th: ใส่สี

# ColumnAdvancedDelay
source: Expand delay (ms)
th: เวลารอก่อนขยายคอลัมน์ (ms)

# ColumnAdvancedDelayInfo
source: When cursor enters a folder column, program will wait for:
th: เมื่อชี้เมาส์ที่คอลัมน์ของโฟลเดอร์ โปรแกรมจะคอยเป็นเวลา:

# ColumnAdvancedDuration
source: Expand duration (ms)
th: เวลาที่ใช้เพื่อขยายคอลัมน์ (ms)

# ColumnAdvancedDurationInfo
source: and then animate expanding the column for:
th: และแสดงแอนิเมชั่นขยายคอลัมน์:

# ColumnAdvancedExpandAnimateAll
source: Set to max to animate all
th: เลื่อนไปขวาสุดเพื่อแสดงแอนิเมชั่นทั้งหมด

# ColumnAdvancedExpandTriggerWidth
source: Trigger width
th: ความกว้างที่ต้องแสดงแอนิเมชั่น

# ColumnAdvancedExpandTriggerWidthInfo
source: One Commander only expands columns smaller than this:
th: One Commander จะขยายเฉพาะคอลัมน์ที่เล็กกว่า:

# ColumnAlignColumnsLayout
source: Column Pane alignment in Columns Layout
th: การจัดแนวบานหน้าต่างคอลัมน์ในเค้าโครงแนวนอน

# ColumnAlignDefaultLeft
source: Default Left
th: ชิดซ้ายเป็นค่าเริ่มต้น

# ColumnAlignDefaultRight
source: Default Right
th: ชิดขวาเป็นค่าเริ่มต้น

# ColumnAlignStandardLayout
source: Column Pane alignment in Standard Layout
th: การจัดแนวบานหน้าต่างคอลัมน์ในเค้าโครงมาตรฐาน

# ColumnAutoExpandColumnsLayout
source: Expand Column when cursor enters it (Columns layout)
th: ขยายคอลัมน์เมื่อชี้เมาส์ (เค้าโครงแนวนอน)

# ColumnAutoExpandStandardLayout
source: Expand Column when cursor enters it (Standard layout)
th: ขยายคอลัมน์เมื่อชี้เมาส์ (เค้าโครงมาตรฐาน)

# ColumnMinimumWidth
source: Columns minimum width
th: ความกว้างคอลัมน์ต่ำสุด

# ColumnMinimumWidthInfo
source: Minimum width for all columns:
th: ความกว้างต่ำสุดสําหรับคอลัมน์ทั้งหมด:

# ColumnParentWidth
source: Parent column width
th: ความกว้างคอลัมน์หลัก

# ColumnParentWidthInfo
source: When space is limited, parent folder column will try to expand to this size:
th: เมื่อพื้นที่จํากัด คอลัมน์ของโฟลเดอร์หลักจะขยายให้มีขนาดดังนี้:

# ColumnWidthCurrentColumnsLayout
source: Current (rightmost) column pane width in Columns layout
th: ความกว้างบานหน้าต่างคอลัมน์ปัจจุบัน (ขวาสุด) ในเค้าโครงแนวนอน

# ColumnWidthOther
source: Maximum non-current column width
th: ความกว้างสูงสุดของคอลัมน์ที่ไม่ใช่ปัจจุบัน

# ColumnWidthSmall
source: Columns small width
th: ความกว้างคอลัมน์ขนาดเล็ก

# CommandShellArgs
source: Arguments
th: อาร์กิวเมนต์

# CommandShellArgsInfo
source: $CurrentPath will be replaced with current path
th: $CurrentPath จะถูกแทนที่ด้วย path ปัจจุบัน

# CommandShellInfo
source: Choose between CMD, PowerShell, or Windows Terminal
th: เลือกระหว่าง CMD, PowerShell หรือ Windows Terminal

# ComputerNameCustom
source: Custom alias
th: กำหนดนามแฝง

# ComputerNameInfo
source: This is the name of the first column pane that contains drives list. Machine name can be changed in Windows Settings
th: นี่คือชื่อของหน้าต่างคอลัมน์แรกที่มีรายการไดรฟ์ต่าง ๆ ชื่อเครื่องจริง ๆ สามารถเปลี่ยนได้ในการตั้งค่า Windows

# ComputerNameMachineName
source: Machine name
th: ชื่อเครื่อง

source: Context Menu Item padding
th: ระยะห่างระหว่างรายการในเมนู

# ContextMenuItemPaddingInfo
source: Make it larger for easier touchscreen access
th: ระยะห่างมากขึ้นจะทำให้ใช้งานกับจอสัมผัสง่ายขึ้น

# CreateDefaultSidebarFoldersInfo
source: Creates favorites group with current username, and adds default folders such as Desktop, Documents, and the rest
th: สร้างกลุ่มโฟลเดอร์โปรดด้วยชื่อผู้ใช้ปัจจุบัน และเพิ่มโฟลเดอร์เริ่มต้น เช่น เดสก์ท็อป เอกสาร และโฟลเดอร์อื่น ๆ

source: Create New Columns without animating
th: สร้างคอลัมน์ใหม่โดยไม่แสดงแอนิเมชั่น

source: Date format
th: รูปแบบวันที่

# DateShownCreated
source: Date created
th: วันที่สร้าง

# DateShownQuestion
source: Date shown in list of files
th: วันที่ที่แสดงในรายการไฟล์

# DefaultFileManagerUnregister
source: Unregister
th: ยกเลิกการลงทะเบียน

# DLG_Unregistered
source: Unregistered
th: ยกเลิกการลงทะเบียนแล้ว

# DLG_YN_ClearThumbnailCache
source: Proceed to terminate explorer.exe, delete Windows thumbnail cache files, and then restart explorer.exe? This will terminate all ongoing file operations!!!
th: ทำต่อเพื่อหยุดการทำงานของ explorer.exe ลบไฟล์แคชรูปย่อของวินโดวส์และเริ่มการทำงาน explorer.exe ใหม่? การทำแบบนี้จะยุติสิ่งที่คุณกำลังทำกับไฟล์ทุกอย่าง!!!

# DLG_YN_DefaultFileManagerRegister
source: Important: This is an <b>experimental feature</b> that will edit your Registry to make One Commander the default file manager and folder handler (Open/Save dialogs cannot be replaced). <br/><b>This will make Windows File Explorer unusable</b> - even when clicking a folder in File Explorer the One Commander will open. <br/>You will need to <b>unregister it</b> if you ever move or remove One Commander (uninstalling it will not reverse changes)!<br/>This will also enable running in the background for faster window opening.<br/>Are you absolutely sure you want to proceed and you know how to restore the registry on your own if something fails (no support in case of recovery)?
th: สำคัญ: คุณสมบัตินี้ <b>อยู่ในขั้นทดลอง</b> ซึ่งจะแก้ไขรีจิสทรีเพื่อให้ One Commander กลายเป็นโปรแกรมเริ่มต้นสำหรับการจัดการไฟล์และโฟลเดอร์ (แต่กล่องโต้ตอบสำหรับ เปิด/บันทึก จะยังคงเดิม) <br/><b>คุณจะไม่สามารถใช้งาน Windows File Explorer ได้</b> - แม้แต่การคลิกโฟลเดอร์ใน File explorer ก็จะเป็นการเปิด One Commander ขึ้นมา <br/>คุณจะต้องกด <b>ยกเลิกการลงทะเบียน</b>ก่อน หากคุณต้องการย้ายหรือลบ One Commander (การเพียงแต่ถอนการติดตั้งจะไม่ยกเลิกการลงทะเบียน)!<br/>การลงทะเบียนยังช่วยให้โปรแกรมทำงานในเบื้องหลังเพื่อการเรียกใช้งานที่เร็วขึ้นด้วย<br/>คุณแน่ใจหรือไม่ว่าต้องการทำต่อ และหากมีบางสิ่งผิดพลาด คุณทราบวิธีกู้คืนรีจิสทรีด้วยตัวเองแล้วหรือไม่ (ผู้พัฒนาขอไม่ให้ความช่วยเหลือในเรื่องนี้)?

# DLG_YN_RestartToApplyChanges
source: Do you want to <b>restart program now</b> to apply all changes?<br/>This will cancel all ongoing operations initiated by One Commander
th: คุณต้องการ<b>ปิดและเปิดโปรแกรมใหม่</b>เพื่อเริ่มใช้การเปลี่ยนแปลงทั้งหมดในตอนนี้ไหม?<br/>การทำแบบนี้จะยกเลิกสิ่งที่คุณกำลังทำด้วย One Commander ทั้งหมด

# DLG_YN_WinERegister
source: Important: This is an <b>experimental feature</b> that will edit Windows Registry to completely replace Windows File Explorer Win+E hotkey. This registry change will make One Commander open when clicking Explorer shortcut, but won't disable navigation within Explorer. The only way to reverse this is unregistering it from One Commander or running the registry script from One Commander folder (uninstalling OC won't change it automatically). Proceed?
th: สำคัญ: คุณสมบัตินี้ <b>อยู่ในขั้นทดลอง</b> ซึ่งจะแก้ไขรีจิสทรีของวินโดวส์เพื่อให้สามารถเรียกใช้งาน One Commander ด้วยการกดปุ่มลัด Win+E แม้จะยังสามารถใช้ Window File Explorer เพื่อค้นหาไฟล์ได้ แต่การคลิกที่ไอคอนลัดของ Explorer จะเป็นการเรียกใช้งาน One Commander แทน ทางเดียวที่จะทำให้กลับเป็นเหมือนเดิมคือกดปุ่มยกเลิกลงทะเบียนจาก One Commander หรือรันสคริปต์ซึ่งอยู่ในโฟลเดอร์ของ One Commander เท่านั้น (การถอนการติดตั้งจะไม่ยกเลิกการลงทะเบียน). ทำต่อไหม?

# DoubleClickArchiveOpensDefault
source: Open in default program
th: เปิดด้วยโปรแกรมเริ่มต้น

# DoubleClickArchiveQuestion
source: Double-click on an archive should:
th: ดับเบิลคลิกไฟล์ที่ถูกบีบอัดจะ:

# DoubleClickArchiveShowPopup
source: Show popup asking to extract or open in a default program
th: แสดงป๊อปอัปให้เลือกว่าจะแยกไฟล์ลงที่นี่หรือเปิดด้วยโปรแกรมเริ่มต้น

# DownloadIconPacksInfo
source: Downloads additional icons from onecommander.com if they are available. Check file icons dropdown after downloading.
th: ดาวน์โหลดไอคอนเพิ่มเติมจาก onecommander.com หลังจากดาวน์โหลดสามารถตรวจสอบไอคอนได้จากรายการให้เลือก

# DragDropBehaviorConsistent
source: Consistent: Drag always moves; Ctrl+Drag always copies
th: แบบเดิม: ลากจะเป็นการย้าย; Ctrl+ลาก จะเป็นการคัดลอก

# DragDropBehaviorInconsistent
source: Inconsistent File Explorer way Drag moves if the same drive, otherwise copies. Ctrl+Drag to copy if the same drive. Shift+Drag to move to another drive.
th: แบบที่ต่างจาก File Explorer การลากจะย้ายไฟล์ถ้าอยู่ในไดรฟ์เดียวกัน ถ้าคนละไดรฟ์จะเป็นการคัดลอก หากกด Ctrl+ลากวางในไดรฟ์เดียวกันจะเป็นการคัดลอก กด Shift+ลากไปไดรฟ์อื่นจะเป็นการย้าย

# DragDropBehaviorQuestion
source: Drag and Drop behavior:
th: สิ่งที่จะเกิดเมื่อลากไฟล์แล้วปล่อย:

source: Example
th: ตัวอย่าง

source: Excluded watcher keywords
th: Watcher keywords ที่ถูกละเว้น

# ExcludedWatcherKeywordsInfo
source: Changes in files with full-paths containing these strings won't be reported; Comma separated
th: ไม่ต้องรายงานการเปลี่ยนแปลงของไฟล์ต่าง ๆ ที่มีสตริงเหล่านี้อยู่ในพาธแบบเต็ม; คั่นด้วยจุลภาค

# ExFileItemDefault
source: File Item Default
th: ไฟล์ปกติ

# ExFileItemMouseOver
source: File Item Mouse Over
th: ไฟล์ที่ถูกชี้เมาส์

# ExFileItemMouseSelected
source: File Item Selected
th: ไฟล์ที่ถูกเลือก

# ExFileItemMouseSelectedMouseOver
source: File Item Selected Mouse Over
th: ไฟล์ที่ถูกเลือกและถูกชี้เมาส์

source: File icons pack
th: ชุดไอคอน

source: File operations handler
th: ตัวดำเนินการไฟล์

# FilesViewDefault
source: Default files view
th: มุมมองไฟล์เริ่มต้น

# FilesViewThumbnails
source: Thumbnail file view
th: มุมมองไฟล์รูปย่อ

# FixStylusLag
source: Fix Stylus lag (breaks touchscreen double-tap to open)
th: แก้ไขความหน่วงของปากกาสไตลัส (ไม่สามารถใช้งานแตะสองครั้งเพื่อเปิดได้)

# FixStylusLagInfo
source: Default OFF. If ON there will be no lag with graphic tablets, Wacom or Microsoft Surface stylus, but it will also disable double-tap (touchscreen) to open files (you would then need to use Single Click to Open folders option, and to open files by long-tap and Open from context menu). This is due to a bug in Microsoft WPF. Program restart required
th: ค่าเริ่มต้นคือปิด หากเปิดจะไม่มีความหน่วงเมื่อใช้ปากกาของแท็ปเลต, Wacom หรือ Microsoft Surface แต่จะไม่สามารถแตะสองครั้งเพื่อเปิดไฟล์สำหรับหน้าจอสัมผัสได้ (คุณจึงจำเป็นต้องเลือกตัวเลือก 'แตะครั้งเดียวเพื่อเปิดโฟลเดอร์' และเพื่อเปิดไฟล์จะต้องแตะค้างไว้และเลือกเปิดจากเมนู) นี่เป็นเพราะข้อบกพร่องใน Microsoft WPF เมื่อเปิดตัวเลือกนี้จะต้องเริ่มการทำงานโปรแกรมใหม่

# FolderIconOverrideInfo
source: Using anything except Windows Default will disable folder icon overlays
th: การใช้สิ่งใดก็ตามยกเว้นค่าเริ่มต้นของวินโดวส์ จะปิดใช้งานโฟลเดอร์ไอคอนโอเวอร์เลย์

source: Folder icons pack
th: ชุดไอคอนโฟลเดอร์

source: Font
th: ฟอนต์

# HeaderAdvanced
source: Advanced
th: ขั้นสูง

# HeaderBuiltInPreviewWindow
source: Built-in preview window
th: หน้าต่างแสดงตัวอย่างที่มากับโปรแกรม

# HeaderExperimental
source: Experimental
th: อยู่ในขั้นทดลอง

# HeaderInteraction
source: Interaction
th: การโต้ตอบ

# HeaderItemProperties
source: Item properties
th: คุณสมบัติของรายการ

# HeaderPanelSizes
source: Pane sizes
th: ขนาดบานหน้าต่าง

# HeaderPanelSizesRestartRequired
source: These settings are applied AFTER program window is reopened
th: การตั้งค่าเหล่านี้จะถูกนําไปใช้หลังจากเปิดหน้าต่างโปรแกรมใหม่

# HeaderPreviewPane
source: Preview pane
th: บานหน้าต่างแสดงตัวอย่าง

# HeaderSidebar
source: Sidebar
th: แถบด้านข้าง

# HeaderSorting
source: Sorting
th: การเรียงลำดับ

# HeaderTheme
source: Theme
th: ธีม

# HeaderThumbnails
source: Thumbnails
th: รูปขนาดย่อ

# HeaderVisibility
source: Visibility
th: การมองเห็น
