Repository: TuTAH1/OneCommander-Localization
Catalog: Rapidrive.*.xlf
Languages: th

# MSG_E_InvalidCharactersInName
source: Invalid name {0}; contains unsupported characters for Windows
th: ชื่อไม่ถูกต้อง {0} มีอักขระที่ Windows ไม่รองรับ

# MSG_E_InvalidCharactersInPath
source: Invalid path {0}; contains unsupported characters for Windows
th: พาธไม่ถูกต้อง {0} พบอักขระที่วินโดวส์ไม่รองรับ

# MSG_E_InvalidPath
source: Invalid path
th: พาธไม่ถูกต้อง

# MSG_E_InvalidRemoteMachineName
source: {0} is not a valid remote machine name
th: {0} ไม่ใช่ชื่อเครื่องระยะไกลที่ถูกต้อง

# MSG_E_ItemDoesNotExist
source: Item doesn't exist: {0}
th: ไม่มีรายการนี้อยู่: {0}

# MSG_E_NoteEmpty
source: Note empty
th: บันทึกว่างเปล่า

# MSG_E_NoteToggleFailed
source: Checking/Unchecking note failed {0}
th: ไม่สามารถบันทึกโน้ตได้ {0}

# MSG_E_OpeningMixedTypeItems
source: Can't open multiple items if one or more folders are selected
th: ไม่สามารถเปิดหลายรายการได้ถ้ามีอย่างน้อยหนึ่งโฟลเดอร์ถูกเลือกอยู่

# MSG_E_PasswordProtectedNoPreview
source: Password protected file cannot be previewed
th: ไม่สามารถแสดงตัวอย่างไฟล์ที่ถูกป้องกันด้วยรหัสผ่านได้

# MSG_E_PastingIntoMultipleFolders
source: Pasting into multiple folders at once is not implemented
th: ไม่สามารถวางลงในหลายโฟลเดอร์พร้อมกันได้

# MSG_E_PathContainsColon
source: This path format is not supported
th: ไม่รองรับรูปแบบพาธนี้

# MSG_E_PathContainsHttpOrFtp
source: http(s) and (s)ftp are not supported. Enter \\hostname\
th: ไม่รองรับ http(s) และ (s)ftp กรุณาใส่ชื่อ \\hostname\

# MSG_E_PathContainsNfs
source: Enter \\hostname\
th: กรุณาใส่ชื่อ \\hostname\

# MSG_E_PathContainsSmb
source: Windows already uses smb. Enter \\hostname\
th: Windows ใช้ smb อยู่แล้ว กรุณาใส่ชื่อ \\hostname\

# MSG_E_QuicklookNotRunning
source: QuickLook not runing. Start it, or disable it in Settings>Preview
th: QuickLook ไม่ทำงาน โปรดเริ่มการทำงาน หรือปิดการทำงานใน การตั้งค่า>แสดงตัวอย่าง

# MSG_E_RecycleBinError
source: Error getting Recycle Bin Items. Right-Click on Recycle Bin in sidebar and click Open
th: เกิดข้อผิดพลาดขณะเรียกรายการในถังขยะ คลิกขวาบนถังขยะในแถบด้านข้าง แล้วคลิก เปิด

# MSG_E_ShellFileOperationFailedElevate
source: You will need to run program as Admin to complete this operation (Ctrl+Shift+F12)
th: คุณต้องใช้งานโปรแกรมในฐานะ Admin เพื่อดําเนินการนี้ให้เสร็จสมบูรณ์ (Ctrl+Shift+F12)

# MSG_E_ShellFileOperationFailedPathTooLong
source: Failed operation. Is path over the Windows' 260 character limit?
th: การดําเนินการล้มเหลว ความยาวพาธเกิน 260 อักขระซึ่งเป็นขีดจำกัดของวินโดวส์หรือไม่?

# MSG_E_ThemeFileNotFound
source: Theme file not found at {0}
th: ไม่พบธีมที่ {0}

# MSG_E_ThemeLoadingFailed
source: Theme loading failed. {0}
th: การโหลดธีมล้มเหลว {0}

# MSG_E_UnableToExtract
source: Unable to extract files from {0}
th: ไม่สามารถแยกไฟล์จาก {0}

# MSG_E_UnableToUpdate
source: Error updating program to new version
th: ข้อผิดพลาดในการอัพเดตโปรแกรมเป็นรุ่นใหม่

# MSG_E_UpdateDownloadError
source: Could not download the update. Full error is {0}
th: ไม่สามารถดาวน์โหลดอัพเดตได้ ข้อผิดพลาดทั้งหมดคือ {0}

# MSG_I_CannotFitBothBrowsers
source: Can't fit both browsers at this window size. Switching to single browser view
th: ไม่สามารถแสดงเบราเซอร์ทั้งสองในหน้าต่างขนาดนี้ได้ โปรแกรมจะแสดงเบราเซอร์เดียว

# MSG_I_ClipboardCopy
source: Selection copied to Windows Clipboard
th: คัดลอกส่วนที่เลือกไปยังคลิปบอร์ดของวินโดวส์แล้ว

# MSG_I_ClipboardCut
source: Selection cut to Windows Clipboard
th: ตัดส่วนที่เลือกไปยังคลิปบอร์ดของวินโดวส์แล้ว

# MSG_I_ClipboardHasImage
source: Detected Image on Clipboard. Press CTRL + V to Paste as a new PNG file
th: ตรวจพบไฟล์ภาพในคลิปบอร์ด กด CTRL + V เพื่อวางภาพเป็นไฟล์ PNG ใหม่

# MSG_I_ClipboardHasPath
source: New path on clipboard. Press Ctrl+Shift+T to open it in a new tab
th: พบพาธใหม่บนคลิปบอร์ด กด Ctrl+Shift+T เพื่อเปิดพาธนั้นในแท็บใหม่

# MSG_I_ClipboardHasText
source: Detected Text on Clipboard. Press CTRL + V to create a new TXT file with this text
th: ตรวจพบข้อความบนคลิปบอร์ด กด CTRL + V เพื่อใช้ข้อความนี้สร้างไฟล์ TXT ใหม่

# MSG_I_ClipboardImagePasted
source: Created an image file: {0} from Clipboard data
th: สร้างไฟล์ภาพแล้ว: {0} จากข้อมูลในคลิปบอร์ด

# MSG_I_ClipboardTextPasted
source: Created a text file: {0} from Clipboard data
th: สร้างไฟล์ข้อความแล้ว: {0} จากข้อมูลในคลิปบอร์ด

# MSG_I_CopyingItemsBetweenBrowsers
source: Copying {0} item(s) from {1} to {2}
th: กำลังคัดลอก {0} รายการจาก {1} ไป {2}

# MSG_I_DownloadingThemeResources
source: Downloading theme resources...
th: กําลังดาวน์โหลดชุดธีม...

# MSG_I_DragDropCanceled
source: Drag operation canceled
th: ยกเลิกการลากแล้ว

# MSG_I_DragDropCanceledTooFast
source: Drag slower if you intend to move files
th: ลากให้ช้าลงถ้าคุณต้องการย้ายไฟล์

# MSG_I_DropFileContentsFinished
source: Finished processing {0} file(s) from drop package
th: การประมวลผลไฟล์ที่นำมาวางสำเร็จ {0} ไฟล์

# MSG_I_DropFileContentsStarted
source: Creating temporary files from drop package before the move...
th: กำลังสร้างไฟล์ชั่วคราวจากไฟล์ที่ลากมาวาง ก่อนทำการย้าย...

# MSG_I_DropSameSourceAndDestination
source: Drop operation cancelled - destination same as source
th: การลากวางถูกยกเลิก - ปลายทางกับที่มาเป็นที่เดียวกัน

# MSG_I_Duplicated
source: File duplicated
th: ไฟล์ซ้ำกัน

# MSG_I_EjectingDrive
source: Ejecting {0}...
th: กำลังนำออก {0}...

# MSG_I_FileOpened
source: File opened
th: เปิดไฟล์แล้ว

# MSG_I_MonitoringDriveStopped
source: Monitoring of drive {0} stopped
th: การตรวจสอบไดรฟ์ {0} ได้หยุดลง

# MSG_I_MovingItemsBetweenBrowsers
source: Moving {0} item(s) from {1} to {2}
th: กำลังย้าย {0} รายการจาก {1} ไป {2}

# MSG_I_NoteCreated
source: Note created
th: สร้างโน้ตแล้ว

# MSG_I_PathCopiedToClipboard
source: Path(s) copied to Clipboard
th: คัดลอกทุกพาธไปยังคลิปบอร์ดแล้ว

# MSG_I_ProgramLaunched
source: Program launched
th: เปิดโปรแกรมแล้ว

# MSG_I_RefreshRequiredPathLong
source: Folder content changed but the path is too long for Windows to report. Refresh manually (F5)
th: เนื้อหาของโฟลเดอร์มีการเปลี่ยนแปลง แต่พาธยาวเกินไปสําหรับ Windows ที่จะรายงาน รีเฟรชด้วยตนเอง (F5)

# MSG_I_Renamed
source: Item renamed
th: เปลี่ยนชื่อแล้ว

# MSG_I_ShellFileOperationAdded
source: Processing {0} item(s)
th: กําลังประมวลผล {0} รายการ

# MSG_I_ShellFileOperationCompleted
source: Finished processing {0} item(s)
th: การประมวลผลเสร็จสิ้น {0} รายการ

# MSG_I_ShellFileOperationUserCancelled
source: User-cancelled operation
th: ผู้ใช้ยกเลิกการดำเนินงานแล้ว

# MSG_I_ShellPasteExecuted
source: Shell Paste executed
th: ดำเนินการวางด้วย Shell แล้ว

# MSG_I_ThemeResourcesDownloaded
source: Theme resources downloaded
th: ดาวน์โหลดชุดธีมแล้ว

# MSG_I_UpdateAvailableForStoreVersion
source: Update available. You can update through Microsoft Store
th: มีรุ่นอัพเดต คุณสามารถอัพเดตผ่าน Microsoft Store

# MSG_YN_FileAlreadyExistsReplace
source: File with this name already exists. Do you want to replace it?
th: มีไฟล์ชื่อนี้อยู่แล้ว คุณต้องการแทนที่หรือไม่?

# NavigateBackward_TT
source: Go back in tab history
th: กลับไปยังแท็บในประวัติ

# NavigateForward_TT
source: Go forward in tab history
th: ไปแท็บต่อไปในประวัติ

# NewFolder_TT
source: Create new folder
th: สร้างโฟลเดอร์ใหม่

source: New group
th: กลุ่มใหม่

# NewNote_TT
source: Create a note in current folder
th: สร้างโน้ตในโฟลเดอร์ปัจจุบัน

# NewTab_S
source: CTRL + T to create | CTRL + W to close selected | CTRL + TAB to switch to next tab
th: CTRL + T เพื่อสร้าง | CTRL + W เพื่อปิดแท็บที่เลือก | CTRL + TAB เพื่อเลื่อนไปแท็บถัดไป

# NewTab_TT
source: Create new tab
th: สร้างแท็บใหม่

# NewWindowCreate
source: Create
th: สร้าง

# NewWindowTitle
source: New window
th: หน้าต่างใหม่

# NewWindow_TT
source: Open new or saved window
th: เปิดหน้าต่างใหม่หรือหน้าต่างที่บันทึกไว้

# Notifications_Minimize_S
source: ESC to close | ~ to open
th: ESC เพื่อปิด | ~ เพื่อเปิด

# Notifications_Minimize_TT
source: Minimizes Notification Pane
th: ย่อบานหน้าต่างการแจ้งเตือน

# OverlayContracting
source: Collapse
th: ยุบ

# PathsGroupTitleClipboard
source: Clipboard
th: คลิปบอร์ด

# PathsGroupTitleTabHistory
source: Tab's history
th: ประวัติของแท็บ

# PathTooLong_TT
source: Path longer than Windows supported (260 characters) Some programs won't be able to open/save files from this folder
th: พาธมีความยาวเกินกว่าที่วินโดวส์จะรองรับ (260 อักขระ) บางโปรแกรมไม่สามารถเปิด/บันทึกไฟล์จากโฟลเดอร์นี้ได้

# Popup_NewFile_CloneAndOpen_TT
source: Creates and opens file in the default system program after cloning it
th: สร้างและเปิดไฟล์ในโปรแกรมเริ่มต้นหลังจากโคลนเสร็จแล้ว

# Popup_NewFile_Clone_TT
source: Creates copy of the selected template file with above filename in current folder
th: สร้างสําเนาของไฟล์แม่แบบที่เลือก ตั้งชื่อตามด้านบนและใส่ในโฟลเดอร์ปัจจุบัน

# Popup_NewFile_Title
source: New file
th: ไฟล์ใหม่

# Popup_NewFolder_Create
source: Create
th: สร้าง

# Popup_Note_Text_TT
source: To add new line press Ctrl + Enter
th: เพิ่มบรรทัดใหม่ ให้กด Ctrl + Enter

# Preview_EmptyFile
source: Empty file
th: ไฟล์ว่างเปล่า

# Preview_FolderError
source: Error loading folder preview
th: ข้อผิดพลาดในการแสดงตัวอย่างโฟลเดอร์

# Preview_FolderPathTooLong
source: Error loading folder preview. Windows doesn't support paths this long for some system operations
th: ข้อผิดพลาดในการแสดงตัวอย่างโฟลเดอร์ วินโดวส์ไม่รองรับพาธที่ยาวขนาดนี้สําหรับการดําเนินการบางอย่างของระบบ

# Preview_LoadAsTextFailed
source: Couldn't load text preview
th: ไม่สามารถแสดงตัวอย่างข้อความได้

# Preview_Loading
source: Loading...
th: กำลังโหลด...

# Preview_NextPage_TT
source: Next page
th: หน้าถัดไป

# Preview_NoPreview
source: No preview
th: ไม่มีภาพตัวอย่าง

# Preview_OfflineFile
source: File not available. Cloud files that aren't synced are not previewed, since they would have to be downloaded
th: ไฟล์ไม่พร้อมใช้งาน ไฟล์บนคลาวด์ที่ไม่ได้ซิงค์จะไม่ถูกแสดงตัวอย่างจนกว่าจะดาวน์โหลดก่อน

# Preview_PreviousPage_TT
source: Previous page
th: หน้าก่อนหน้า

# Preview_TabMultimedia
source: Multimedia
th: มัลติมีเดีย

# Preview_TextTrimmed
source: Preview trimmed to first {0}K characters
th: แสดงอักขระที่ถูกตัด {0}K ตัวแรก

source: Recycle Bin
th: ถังรีไซเคิล

# Rename_TT
source: Rename
th: เปลี่ยนชื่อ

source: Search
th: ค้นหา

# SearchLocation
source: Location
th: ที่เก็บ

# SearchStop
source: Stop
th: หยุด

# SearchWithin
source: within
th: ภายใน

# Search_TT
source: Search files starting from currently opened folder
th: ค้นหาไฟล์โดยเริ่มจากโฟลเดอร์ที่เปิดอยู่ในปัจจุบัน

# SortByDate
source: DATE
th: วันที่

# SortByDate_NewestFirst_TT
source: Sorts items by date modified (Newest first)
th: เรียงลําดับรายการตามวันที่แก้ไข (ใหม่ที่สุดก่อน)

# SortByDate_OldestFirst_TT
source: Sorts items by date modified (Oldest first)
th: เรียงลําดับรายการตามวันที่แก้ไข (เก่าที่สุดก่อน)

# SortByName
source: NAME
th: ชื่อ

# SortBySize
source: SIZE
th: ขนาด

# SortByType
source: TYPE
th: ประเภท

# SortByType_Ascending_TT
source: Sorts items by type (A-Z)
th: เรียงลําดับรายการตามประเภท (A-Z)

# SortByType_Descending_TT
source: Sorts items by type (Z-A)
th: เรียงลําดับรายการตามประเภท (Z-A)

# SortFoldersOnTop_TT
source: Keep folders on top toggle
th: ปุ่มสลับการเก็บโฟลเดอร์ไว้ด้านบน

# Sort_TT
source: Sort files
th: เรียงลําดับไฟล์

# SysTrayMenu_Exit
source: Exit
th: ออก

# SysTrayMenu_NewWindow
source: New window
th: หน้าต่างใหม่

# TIP_ChangingThumbSize
source: TIP: User Ctrl + Mouse wheel to change thumbnail size / items per column
th: เคล็ดลับ: Ctrl + หมุนล้อเพื่อปรับขนาดรูปย่อ/จำนวนรายการต่อคอลัมน์

# TIP_PreviewZoom
source: In Preview you can use Mouse Wheel to zoom, even when previewing a video
th: ในการแสดงตัวอย่าง คุณสามารถใช้ล้อเลื่อนของเมาส์เพื่อขยายได้แม้ในขณะที่แสดงตัวอย่างวิดีโอ

# TIP_WindowSelect
source: TIP: You can draw selection-window by holding Middle-Mouse-Button without needing to use empty space
th: เคล็ดลับ: คุณวาดกรอบการเลือกเพื่อเลือกหลายไฟล์ได้โดยกดค้างที่ปุ่มกลางของเมาส์

source: Unlock
th: ปลดล็อค

# Update_TT
source: Install latest update
th: ติดตั้งการอัพเดตล่าสุด

source: Updating...
th: กำลังอัพเดต...

# Watermark_DragFilesHere
source: Drag files here
th: ลากไฟล์มาที่นี่

# Watermark_Empty
source: Empty
th: ว่าง

# Watermark_GettingRecycleBinItems
source: Getting Recycle Bin items...
th: กำลังเรียงรายการในถังรีไซเคิล...

# Watermark_InvalidFolderCharacters
source: Folder name contains characters unsupported by Windows
th: ชื่อโฟลเดอร์มีอักขระที่วินโดวส์ไม่รองรับ

# Watermark_NoAccess
source: No access
th: ไม่มีการเข้าถึง

# Watermark_NoAccessTryElevating
source: No access. Try restarting as Admin (Ctrl+Shift+F12)
th: ไม่มีการเข้าถึง ลองเริ่มการทํางานใหม่ในฐานะผู้ดูแลระบบ (Ctrl+Shift+F12)

# Watermark_NoShares
source: No accessible shares found
th: ไม่พบส่วนที่แชร์ที่สามารถเข้าถึงได้

# Watermark_WSLEmpty
source: No WSL distros found. Make sure they are running
th: ไม่พบ WSL distros โปรดตรวจสอบว่าเปิดการทำงานอยู่หรือไม่
